app/controllers/exams_controller.rb

SELECT * FROM `exams` WHERE (`exams`.`id` = '953125641') LIMIT 1
UPDATE `exams` SET `length_done` = 30 WHERE `id` = 953125641
---
  def status
    @subjects = SubjectLesson.current current_user.id
    @exam = Exam.find_by_id params[:id]
    status = params[:status]

    if status == "done"
      @exam.length_done = @exam.length
    else
      @exam.length_done = 0;
    end

    @exam.save

SELECT * FROM `exams` WHERE (`exams`.`id` = 953125641)
---
  def show
    @exam = Exam.find(params[:id])

SELECT * FROM `exams` WHERE (`exams`.`id` = 953125641)
---
  def edit
    @exam = Exam.find(params[:id])

INSERT INTO `exams` (`notes`, `length_done`, `length`, `subject_id`, `when`) VALUES(NULL, 0, NULL, NULL, '2009-08-05')
---
  def create
    @exam = Exam.new(params[:exam])

    respond_to do |format|
      if @exam.save

SELECT * FROM `exams` WHERE (`exams`.`id` = 953125641)
---
  def update
    @exam = Exam.find(params[:id])

SELECT * FROM `exams` WHERE (`exams`.`id` = 953125641)
DELETE FROM `exams` WHERE `id` = 953125641
---
  def destroy
    @exam = Exam.find(params[:id])
    @exam.destroy