app/controllers/homeworks_controller.rb

  def status
    @subjects = SubjectLesson.current current_user.id
    @homework = Homework.find_by_id params[:id]
    status = params[:status]

    if status == "done"
      @homework.length_done = @homework.length
    else
      @homework.length_done = 0;
    end

    @homework.save
---
SELECT * FROM `homeworks` WHERE (`homeworks`.`id` = '953125641') LIMIT 1
UPDATE `homeworks` SET `length_done` = 30 WHERE `id` = 953125641

  def show
    @homework = Homework.find(params[:id])
---
SELECT * FROM `homeworks` WHERE (`homeworks`.`id` = 953125641)

  def edit
    @homework = Homework.find(params[:id])
---
SELECT * FROM `homeworks` WHERE (`homeworks`.`id` = 953125641)

  def create
    @homework = Homework.new(params[:homework])

    respond_to do |format|
      if @homework.save
---
INSERT INTO `homeworks` (`notes`, `length_done`, `length`, `subject_id`, `when`) VALUES(NULL, 0, NULL, NULL, '2009-08-05')

  def update
    @homework = Homework.find(params[:id])
---
SELECT * FROM `homeworks` WHERE (`homeworks`.`id` = 953125641)

  def destroy
    @homework = Homework.find(params[:id])
    @homework.destroy
---
SELECT * FROM `homeworks` WHERE (`homeworks`.`id` = 953125641)
DELETE FROM `homeworks` WHERE `id` = 953125641