app/controllers/notes_controller.rb

SELECT * FROM `notes` WHERE (`notes`.`id` = 953125641)
---
  def show
    @note = Note.find(params[:id])

SELECT * FROM `notes` WHERE (`notes`.`id` = 953125641)
---
  def edit
    @note = Note.find(params[:id])

INSERT INTO `notes` (`updated_at`, `weight`, `description`, `subject_id`, `note`, `created_at`) VALUES('2009-09-17 13:49:34', NULL, NULL, NULL, NULL, '2009-09-17 13:49:34')
---
  def create
    @note = Note.new(params[:note])
    @subject = @note.subject

    respond_to do |format|
      if @note.save

SELECT * FROM `notes` WHERE (`notes`.subject_id = 619423396)
SELECT sum(`notes`.note) AS sum_note FROM `notes` WHERE (`notes`.subject_id = 619423396)
---
  def update
    @note = Note.find(params[:id])

SELECT * FROM `notes` WHERE (`notes`.subject_id = 619423396)
SELECT sum(`notes`.note) AS sum_note FROM `notes` WHERE (`notes`.subject_id = 619423396)
DELETE FROM `notes` WHERE `id` = 953125641
---
  def destroy
    @note = Note.find(params[:id])
    @note.destroy

SELECT `notes`.* FROM `notes` INNER JOIN `subjects` ON `subjects`.id = `notes`.subject_id WHERE (subjects.user_id = 1)
SELECT sum(`notes`.note) AS sum_note FROM `notes` WHERE (`notes`.subject_id = 1)
DELETE FROM `notes` WHERE `id` = 2
---
  def reset
    current_user.notes.each do |subject, notes|
      notes.each do |note|
        note.destroy