app/controllers/subject_lessons_controller.rb

  def show
    @subject_lesson = SubjectLesson.find(params[:id])
---
SELECT * FROM `subject_lessons` WHERE (`subject_lessons`.`id` = 953125641)

  def edit
    @subject_lesson = SubjectLesson.find(params[:id])
---
SELECT * FROM `subject_lessons` WHERE (`subject_lessons`.`id` = 953125641)

  def create
    @subject_lesson = SubjectLesson.new(params[:subject_lesson])

    respond_to do |format|
      if @subject_lesson.save
---
INSERT INTO `subject_lessons` (`updated_at`, `lesson`, `day`, `subject_id`, `created_at`) VALUES('2009-09-17 13:49:34', NULL, NULL, NULL, '2009-09-17 13:49:34')

  def update
    @subject_lesson = SubjectLesson.find(params[:id])
---
SELECT * FROM `subject_lessons` WHERE (`subject_lessons`.`id` = 953125641)

  def destroy
    @subject_lesson = SubjectLesson.find(params[:id])
    @subject_lesson.destroy
---
SELECT * FROM `subject_lessons` WHERE (`subject_lessons`.`id` = 953125641)
DELETE FROM `subject_lessons` WHERE `id` = 953125641