app/controllers/subjects_controller.rb

SELECT * FROM `subjects` WHERE (user_id = 745185059)
---
  def index
    @subjects = Subject.find(:all, :conditions => ["user_id = ?", current_user.id])

INSERT INTO `subject_lessons` (`updated_at`, `lesson`, `day`, `subject_id`, `created_at`) VALUES('2009-04-03 11:01:37', 6, 5, 2, '2009-04-03 11:01:37')
---
  def updateTimetable
    # first find all subject_lesson associations
    @lessons = current_user.subject_lessons_hash

    params[:timetable].each do |key, value|
      key = key.sub("slot_", "")
      item = @lessons[key]
      if not value.empty?
        # the lessons has assigned a subject, thus we should either change the lesson or create a new one
        if item
          item.subject_id = value.sub("subject_", "")
          item.save
        else
          item = SubjectLesson.new
          item.day = key.split("_")[0]
          item.lesson = key.split("_")[1]
          item.subject_id = value.sub("subject_", "")
          item.save

SELECT * FROM `subjects` WHERE (`subjects`.user_id = 1)
UPDATE `subjects` SET `color` = 'blue', `time` = 15, `updated_at` = '2009-04-03 11:01:51' WHERE `id` = 1
---
  def settings
    @subjects = current_user.subjects
    if request.post?
      params[:subject].each do |k, v|
        # raise @subjects.to_yaml
         subject = @subjects.detect {|subject| subject.id.to_s == k.to_s}
         subject.update_attributes(v) if subject

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 619423396)
---
  def edit
    @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`updated_at`, `title`, `time`, `priority`, `type`, `color`, `average`, `user_id`, `created_at`) VALUES('2009-09-17 13:49:34', 'Anglictina', NULL, NULL, NULL, NULL, NULL, 745185059, '2009-09-17 13:49:34')
---
  def create
    @subject = Subject.new(params[:subject])
    @subject.user_id = current_user.id

    respond_to do |format|
      if @subject.save

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 619423396)
---
  def update
    @subject = Subject.find(params[:id])

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 619423396)
DELETE FROM `subjects` WHERE `id` = 619423396
---
  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy